---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SkylightFailures
source: html/931407cd-ddeb-2468-3dfa-2ff4c6dba897.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SkylightFailures

Failures about Skylight.

## Syntax (C#)
```csharp
public static class SkylightFailures
```